In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [3]:
%%sql
CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );

 * sqlite://
Done.

[]

In [4]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
10 rows affected.

[]

In [5]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );

 * sqlite://
Done.

[]

In [6]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148'),
('21610','20-OCT-2010','356'),
('21613','21-OCT-2010','408'),
('21614','21-OCT-2010','282'),
('21617','23-OCT-2010','608'),
('21619','23-OCT-2010','148'),
('21623','23-OCT-2010','608');

 * sqlite://
7 rows affected.

[]

In [7]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [8]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [9]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [10]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

In [11]:
%%sql
CREATE TABLE rep (
rep_num CHAR(2) PRIMARY KEY,
last_name CHAR(15) NOT NULL,
first_name CHAR(15) NOT NULL,
street CHAR(15),
city CHAR(15),
state CHAR(2),
zip CHAR(5),
commission DECIMAL(7,2),
rate DECIMAL(3,2)
);

 * sqlite://
Done.

[]

In [12]:
%sql INSERT INTO rep VALUES('20','Kaiser','Valerie','624 Randall','Grove','FL','33321',20542.50,0.05);

 * sqlite://
1 rows affected.

[]

In [13]:
%%sql 
INSERT INTO rep VALUES
('35','Hull','Richard','532 Jackson','Sheldon','FL','33553',39216,0.07),
('65','Perez','Juan','1626 Taylor','Fillmore','FL','33336',23487,0.05);

 * sqlite://
2 rows affected.

[]

**A.1. List the names of all customers that have a credit limit of $7,500 or less.**

In [14]:
%%sql
SELECT customer_name
FROM customer
WHERE credit_limit <= 7500;

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

**A.2. List the order numbers for orders placed by customer number 608 on 10/23/2010.**

In [15]:
%%sql
SELECT order_num
FROM orders
WHERE customer_num = '608'
AND order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617',), ('21623',)]

**A.3. List the part number and part description of all parts that are in item class HW.**

In [16]:
%%sql
SELECT part_num, description
FROM part
WHERE class = 'HW';

 * sqlite://
Done.

[('AT94', 'Iron'), ('DL71', 'Cordless Drill'), ('FD21', 'Stand Mixer')]

**A.4. List the part number, part description, and on-hand value for each part in item class 
SG. (Hint: On-hand value is the result of multiplying the number of units on hand by the 
price.)**

In [17]:
%%sql
SELECT part_num, description, (on_hand * price) AS on_hand_value
FROM part
WHERE class = 'SG';

 * sqlite://
Done.

[('BV06', 'Home Gym', 35772.75), ('KV29', 'Treadmill', 12510)]

**A.5. How many customers have a balance that exceeds their credit limit?**

In [18]:
%%sql
SELECT COUNT(customer_num)
FROM customer
WHERE balance > credit_limit;

 * sqlite://
Done.

[(2,)]

**A.6. What is the part number, description, and price of the least expensive part in the 
database?**

In [19]:
%%sql
SELECT part_num, description, price
FROM part
WHERE price = (SELECT MIN(price) FROM part);

 * sqlite://
Done.

[('AT94', 'Iron', 24.95)]

**A.7. For each order, list the order number, order date, customer number, and customer 
name.**

In [20]:
%%sql
SELECT order_num, order_date, customer.customer_num, customer.customer_name
FROM orders, customer
WHERE orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

**A.8. For each order placed on October 21, 2010, list the order number, customer number, 
and customer name.**

In [21]:
%%sql
SELECT order_num, customer.customer_num, customer.customer_name
FROM orders, customer
WHERE orders.customer_num = customer.customer_num
AND order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', '408', 'The Everything Shop'), ('21614', '282', 'Brookings Direct')]

**A.9. For each order placed on October 21, 2010, list the order number, part number, part 
description, and item class for each part ordered.**

In [22]:
%%sql
SELECT orders.order_num, order_line.part_num, part.description, part.class
FROM orders, order_line, part
WHERE orders.order_num = order_line.order_num
AND order_line.part_num = part.part_num
AND order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', 'KL62', 'Dryer', 'AP'), ('21614', 'KT03', 'Dishwasher', 'AP')]

**C.1. List the number and name of each customer represented by sales rep 35 or sales rep 
65.**

In [23]:
%%sql 
/* c.1 */
select customer_num, customer_name
from customer
where rep_num = 35 or rep_num = 65;

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('608', "Johnson's Department Store"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons")]

**C.2. List the part number and part description of each part that is not in item class AP.**

In [24]:
%%sql 
/* c.2 */
select part_num, description
from part
where class != 'AP';

 * sqlite://
Done.

[('AT94', 'Iron'),
 ('BV06', 'Home Gym'),
 ('DL71', 'Cordless Drill'),
 ('FD21', 'Stand Mixer'),
 ('KV29', 'Treadmill')]

**C.3. List the part number, description, and number of units on hand for each part that has 
between 10 and 25 units on hand, including both 10 and 25. Do this in different two ways.**

In [25]:
%%sql 
/* c.3a */
select part_num, description, on_hand
from part
where on_hand between 10 and 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

In [26]:
%%sql 
/* c.3b */
select part_num, description, on_hand
from part
where on_hand >= 10 and on_hand <= 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

**C.4. Use the IN operator to list the part number and part description of each part in item 
class AP or SG.**

In [27]:
%%sql 
/* c.4 */
select part_num, description
from part
where class in ('AP', 'SG');

 * sqlite://
Done.

[('BV06', 'Home Gym'),
 ('CD52', 'Microwave Oven'),
 ('DR93', 'Gas Range'),
 ('DW11', 'Washer'),
 ('KL62', 'Dryer'),
 ('KT03', 'Dishwasher'),
 ('KV29', 'Treadmill')]

**C.5. Find the number and name of each customer whose name begins with the letter “B.”**

In [28]:
%%sql 
/* c.5 */
select customer_num, customer_name
from customer
where customer_name like 'B%';

 * sqlite://
Done.

[('282', 'Brookings Direct'), ('462', 'Bargains Galore')]

**C.6. List all details about all parts. Order the output by part description.**

In [29]:
%%sql 
/* c.6 */
select * 
from part
order by description;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99)]

**C.7. List all details about all parts. Order the output by part number within warehouse. 
(That is, order the output by warehouse and then by part number.)**

In [30]:
%%sql 
/* c.7 */
select * 
from part 
order by warehouse, part_num;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595)]

**C.8. List the part number, part description, and on-hand value of each part whose number 
of units on hand is more than the average number of units on hand for all parts. (Hint: Use 
a subquery.)**

In [31]:
%%sql 
/* c.8 */
select part_num, description, (on_hand * price) as on_hand_value
from part 
where on_hand > 
(select avg(on_hand)
from part);

 * sqlite://
Done.

[('AT94', 'Iron', 1247.5),
 ('BV06', 'Home Gym', 35772.75),
 ('CD52', 'Microwave Oven', 5280),
 ('FD21', 'Stand Mixer', 3518.8999999999996)]

**C.9. List the sum of the balances of all customers for each sales rep. Order and group the 
results by sales rep number.**

In [32]:
%%sql 
/* c.9 */
select rep_num , sum(balance)
from customer
group by rep_num
order by rep_num;

 * sqlite://
Done.

[('20', 27533), ('35', 8815.75), ('65', 11303)]

**C.10. List the sum of the balances of all customers for each sales rep, but restrict the output 
to those sales reps for which the sum is more than $10,000. Order the results by sales rep 
number.**

In [33]:
%%sql 
/* c.10 */
select rep_num, sum(balance)
from customer
group by rep_num
having sum(balance) > 10000
order by rep_num;

 * sqlite://
Done.

[('20', 27533), ('65', 11303)]

**C.11. List the part number of any part with an unknown description.**

In [34]:
%%sql 
/* c.11 */
select part_num
from part
where description is null;

 * sqlite://
Done.

[]

**D.1. For each order, list the order number and order date along with the number and name 
of the customer that placed the order.**

In [35]:
%%sql
SELECT order_num, order_date, orders.customer_num,customer_name 
FROM orders, customer 
WHERE orders.customer_num = customer.customer_num

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

**D.2. For each order placed on October 23, 2010, list the order number along with the 
number and name of the customer that placed the order.**

In [36]:
%%sql 
SELECT order_num, orders.customer_num, customer_name
FROM orders, customer 
WHERE orders.customer_num = customer.customer_num
AND order_date = '23-OCT-2010'

 * sqlite://
Done.

[('21617', '608', "Johnson's Department Store"),
 ('21619', '148', "Al's Appliance and Sport"),
 ('21623', '608', "Johnson's Department Store")]

**D.3. For each order, list the order number, order date, part number, number of units 
ordered, and quoted price for each order line that makes up the order.**

In [37]:
%%sql 
SELECT orders.order_num, orders.order_date, part_num, num_ordered, quoted_price
FROM orders, order_line
WHERE orders.order_num = order_line.order_num

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 11, 21.95),
 ('21610', '20-OCT-2010', 'DR93', 1, 495),
 ('21610', '20-OCT-2010', 'DW11', 1, 399.99),
 ('21613', '21-OCT-2010', 'KL62', 4, 329.95),
 ('21614', '21-OCT-2010', 'KT03', 2, 595),
 ('21617', '23-OCT-2010', 'BV06', 2, 794.95),
 ('21617', '23-OCT-2010', 'CD52', 4, 150),
 ('21619', '23-OCT-2010', 'DR93', 1, 495),
 ('21623', '23-OCT-2010', 'KV29', 2, 1290)]

**D.4. Use the IN operator to find the number and name of each customer that placed an 
order on October 23, 2010.**

In [38]:
%%sql
SELECT customer_num, customer_name
FROM customer 
WHERE customer_num IN(
    SELECT customer_num 
    FROM orders 
    WHERE order_date = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

**D.5. Repeat Exercise 4, but this time use the EXISTS operator in your answer.**

In [39]:
%%sql
SELECT customer_num, customer_name
FROM customer 
WHERE EXISTS 
(SELECT *
 FROM orders
 WHERE orders.customer_num = customer.customer_num 
 AND order_date = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

**D.6. Find the number and name of each customer that did not place an order on October 
23, 2010.**

In [40]:
%%sql
SELECT customer_num, customer_name
FROM customer 
WHERE NOT customer_num IN(
    SELECT customer_num 
    FROM orders 
    WHERE order_date = '23-OCT-2010');

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('524', "Kline's"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons"),
 ('842', 'All Season')]

**D.7. For each order, list the order number, order date, part number, part description, and 
item class for each part that makes up the order.**

In [41]:
%%sql 
SELECT order_line.order_num, order_line.part_num, orders.order_date, part.description, part.class
FROM order_line, orders, part
WHERE order_line.part_num = part.part_num
AND order_line.order_num = orders.order_num;

 * sqlite://
Done.

[('21608', 'AT94', '20-OCT-2010', 'Iron', 'HW'),
 ('21610', 'DR93', '20-OCT-2010', 'Gas Range', 'AP'),
 ('21610', 'DW11', '20-OCT-2010', 'Washer', 'AP'),
 ('21613', 'KL62', '21-OCT-2010', 'Dryer', 'AP'),
 ('21614', 'KT03', '21-OCT-2010', 'Dishwasher', 'AP'),
 ('21617', 'BV06', '23-OCT-2010', 'Home Gym', 'SG'),
 ('21617', 'CD52', '23-OCT-2010', 'Microwave Oven', 'AP'),
 ('21619', 'DR93', '23-OCT-2010', 'Gas Range', 'AP'),
 ('21623', 'KV29', '23-OCT-2010', 'Treadmill', 'SG')]

**D.8. Repeat Exercise 7, but this time order the rows by item class and then by order 
number**

In [42]:
%%sql 
SELECT order_line.order_num, order_line.part_num, orders.order_date, part.description, part.class
FROM order_line, orders, part
WHERE order_line.part_num = part.part_num
AND order_line.order_num = orders.order_num
ORDER BY part.class, order_line.order_num;

 * sqlite://
Done.

[('21610', 'DR93', '20-OCT-2010', 'Gas Range', 'AP'),
 ('21610', 'DW11', '20-OCT-2010', 'Washer', 'AP'),
 ('21613', 'KL62', '21-OCT-2010', 'Dryer', 'AP'),
 ('21614', 'KT03', '21-OCT-2010', 'Dishwasher', 'AP'),
 ('21617', 'CD52', '23-OCT-2010', 'Microwave Oven', 'AP'),
 ('21619', 'DR93', '23-OCT-2010', 'Gas Range', 'AP'),
 ('21608', 'AT94', '20-OCT-2010', 'Iron', 'HW'),
 ('21617', 'BV06', '23-OCT-2010', 'Home Gym', 'SG'),
 ('21623', 'KV29', '23-OCT-2010', 'Treadmill', 'SG')]

**D.9. Use a subquery to find the rep number, last name, and first name of each sales rep 
who represents at least one customer with a credit limit of $10,000. List each sales rep only 
once in the results.**

In [43]:
%%sql 
SELECT DISTINCT rep_num, last_name, first_name
FROM rep 
WHERE rep_num IN(
SELECT rep_num
FROM customer 
WHERE credit_limit = 10000);

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

**D.10. Repeat Exercise 9, but this time do not use a subquery.**

In [44]:
%%sql 
SELECT DISTINCT rep.rep_num, last_name, first_name
FROM rep, customer 
WHERE rep.rep_num = customer.rep_num 
AND credit_limit = 10000;

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

**D.11. Find the number and name of each customer that currently has an order on file for a 
Gas Range.**

In [45]:
%%sql 
SELECT customer_num, customer_name
FROM customer
WHERE customer_num IN (
SELECT orders.customer_num 
FROM orders, order_line
WHERE orders.order_num = order_line.order_num 
AND order_line.part_num = 'DR93');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('356', "Ferguson's")]

**D.12. List the part number, part description, and item class for each pair of parts that are in 
the same item class. (For example, one such pair would be part AT94 and part FD21, 
because the item class for both parts is HW.)**

In [46]:
%%sql
SELECT part_num, description, class
FROM part
ORDER BY class;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 'AP'),
 ('DR93', 'Gas Range', 'AP'),
 ('DW11', 'Washer', 'AP'),
 ('KL62', 'Dryer', 'AP'),
 ('KT03', 'Dishwasher', 'AP'),
 ('AT94', 'Iron', 'HW'),
 ('DL71', 'Cordless Drill', 'HW'),
 ('FD21', 'Stand Mixer', 'HW'),
 ('BV06', 'Home Gym', 'SG'),
 ('KV29', 'Treadmill', 'SG')]

**D.13. List the order number and order date for each order placed by the customer named 
Johnson’s Department Store. (Hint: To enter an apostrophe (single quotation mark) within a 
string of characters, type two single quotation marks.)**

In [47]:
%%sql 
SELECT order_num, order_date 
FROM orders
WHERE customer_num IN ( 
    SELECT customer_num 
    FROM customer 
    WHERE customer_name = "Johnson's Department Store");

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

**D.14. List the order number and order date for each order that contains an order line for an 
Iron.**

In [48]:
%%sql 
SELECT order_num, order_date 
FROM orders
WHERE order_num IN ( 
    SELECT order_num  
    FROM order_line, part 
    WHERE order_line.part_num = part.part_num
    AND description = "Iron");

 * sqlite://
Done.

[('21608', '20-OCT-2010')]

**D.15. List the order number and order date for each order that either was placed by 
Johnson’s Department Store or that contains an order line for a Gas Range**

In [49]:
%%sql 
SELECT order_num, order_date
FROM orders
WHERE order_num IN (
    SELECT order_num 
    FROM order_line, part
    WHERE part.part_num = order_line.part_num AND description = "Gas Range") 
OR customer_num IN(
    SELECT customer_num
    FROM customer
    WHERE customer_name = "Johnson's Department Store");

 * sqlite://
Done.

[('21610', '20-OCT-2010'),
 ('21617', '23-OCT-2010'),
 ('21619', '23-OCT-2010'),
 ('21623', '23-OCT-2010')]

**List the order number and order date for each order that was placed by Johnson’s 
Department Store and that contains an order line for a Gas Range.**

In [50]:
%%sql 
SELECT order_num, order_date
FROM orders
WHERE order_num IN (
    SELECT order_num 
    FROM order_line, part
    WHERE part.part_num = order_line.part_num AND description = "Gas Range") 
AND customer_num IN(
    SELECT customer_num
    FROM customer
    WHERE customer_name = "Johnson's Department Store");

 * sqlite://
Done.

[]

**D.17. List the order number and order date for each order that was placed by Johnson’s 
Department Store but that does not contain an order line for a Gas Range.**

In [51]:
%%sql 
SELECT order_num, order_date
FROM orders
WHERE NOT order_num IN (
    SELECT order_num 
    FROM order_line, part
    WHERE part.part_num = order_line.part_num AND description = "Gas Range") 
AND customer_num IN(
    SELECT customer_num
    FROM customer
    WHERE customer_name = "Johnson's Department Store");

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

**D.18. For each part, list the part number, description, units on hand, order number, and 
number of units ordered. All parts should be included in the results. For those parts that are 
currently not on order, the order number and number of units ordered should be left blank 
(None/NULL/NA). Order the results by part number.**

In [52]:
%%sql 
SELECT part.part_num, description, on_hand, order_num, num_ordered 
FROM part
LEFT JOIN order_line
on part.part_num = order_line.part_num;

 * sqlite://
Done.

[('AT94', 'Iron', 50, '21608', 11),
 ('BV06', 'Home Gym', 45, '21617', 2),
 ('CD52', 'Microwave Oven', 32, '21617', 4),
 ('DL71', 'Cordless Drill', 21, None, None),
 ('DR93', 'Gas Range', 8, '21610', 1),
 ('DR93', 'Gas Range', 8, '21619', 1),
 ('DW11', 'Washer', 12, '21610', 1),
 ('FD21', 'Stand Mixer', 22, None, None),
 ('KL62', 'Dryer', 12, '21613', 4),
 ('KT03', 'Dishwasher', 8, '21614', 2),
 ('KV29', 'Treadmill', 9, '21623', 2)]